Modul 7/PRAK 701/app/Controllers/Auth.php

SELECT *
FROM `user`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function login()
    {
        $model = new UserModel();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $model->where('username', $username)->first();